Dewanshu-BLOG-Assignment3/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Aditi Hardeniya"], ["text", "Happy Birthday"], ["created_at", "2019-10-17 13:09:42.406576"], ["updated_at", "2019-10-17 13:09:42.406576"]]
---
    def create
        @article = Article.new(article_params)

        if @article.save