Dewanshu-BLOG-Assignment3/app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Aditi's Birthday was on October 16"], ["body", ""], ["article_id", 3], ["created_at", "2019-10-17 13:10:06.306267"], ["updated_at", "2019-10-17 13:10:06.306267"]]
---
    def create
      @article = Article.find(params[:article_id])
      @comment = @article.comments.create(comment_params)